soap/xml/user/request/requestUpdate.xml

<?xml version="1.0" encoding="UTF-8"?>
<SOAP-ENV:Envelope 
	xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" 
	xmlns:ns1="urn:Api" 
	xmlns:xsd="http://www.w3.org/2001/XMLSchema" 
	xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" 
	xmlns:SOAP-ENC="http://schemas.xmlsoap.org/soap/encoding/" 
	SOAP-ENV:encodingStyle="http://schemas.xmlsoap.org/soap/encoding/">
	<SOAP-ENV:Body>
		<ns1:update>
			<id xsi:type="xsd:int">1</id>
			<nome xsi:type="xsd:string">cesar</nome>
			<email xsi:type="xsd:string">cesar@teste.com.br</email>
		</ns1:update>
	</SOAP-ENV:Body>
</SOAP-ENV:Envelope>