soap/xml/user/request/requestCreate.xml

<?xml version="1.0" encoding="UTF-8"?>
<SOAP-ENV:Envelope 
		xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" 
		xmlns:ns1="urn:Api" 
		xmlns:xsd="http://www.w3.org/2001/XMLSchema" 
		xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" 
		xmlns:SOAP-ENC="http://schemas.xmlsoap.org/soap/encoding/" 
		SOAP-ENV:encodingStyle="http://schemas.xmlsoap.org/soap/encoding/">
	<SOAP-ENV:Body>
		<ns1:create>
			<nome xsi:type="xsd:string">eduardo</nome>
			<email xsi:type="xsd:string">eduardo@teste.com.br</email>
		</ns1:create>
	</SOAP-ENV:Body>
</SOAP-ENV:Envelope>